#include<stdio.h>
#include <locale.h>
//#include<string.h>
int main ()
{	
setlocale(LC_ALL, "Rus");
    int n = 10,s,srar,srar2,s1=0,s2=0,i=0,f;
	int p[n]= {0,333,3,7,10,52,88,27,15,43};

///////////////////////Сортировка массива по возрастанию.///////////////////////////////////////////////////////////////////////
for ( n=0;n<10-0;n++) {
        for (s=0; s<10-n-0; s++) {
            if (p[s]>p[s+1]) {
                
				f= p[s];
                p[s] = p[s+1];
                p[s+1]=f;
	
}
}
printf(" |el=%d|",p[n]);
}
///////////////////////////////////////////////////////////////////////////////////////////////////

/////////////////////количество элементов массива ,больших среднего арифметического массива.///////////////////////////////////////////////////////

for (n=0;n<10;n++)
{   s2=s2+p[n];
}
    srar2=s2/n;
for(n=0;n<10;n++)
{
if (srar2<p[n])
{
    i=i+1;	
}    	

}
printf("\nКол-во элементов массива ,больших среднего ариф. массива" ": " "%d",i);
///////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////среднее арифмитическое элементов массива ,не кратных 3.///////////////////////////////////////////////////// 

for (n=0;n<10;n++)
{
if (p[n]% 3 == 0)
{
	p[n]=0;
}
else{
	s1=s1+1;
}
    s=s+p[n];
}
    srar=s/s1;
printf("\nСредее ариф. элементов массива, не кратных 3: %d",srar);
////////////////////////////////////////////////////////////////////////////////////////////////

return 0;
}






